In [1]:
import numpy as np
import pandas as pd

In [3]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [4]:
data

a  1   -0.527131
   2   -0.910607
   3    0.298445
b  1    0.113082
   3    0.449941
c  1    1.809865
   2   -0.155255
d  2   -0.432563
   3    0.378351
dtype: float64

In [5]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [6]:
data["b"]

1    0.113082
3    0.449941
dtype: float64

In [7]:
data["b":"c"]

b  1    0.113082
   3    0.449941
c  1    1.809865
   2   -0.155255
dtype: float64

In [8]:
data.loc[["b","d"]]

b  1    0.113082
   3    0.449941
d  2   -0.432563
   3    0.378351
dtype: float64

In [9]:
data.loc[:,2]

a   -0.910607
c   -0.155255
d   -0.432563
dtype: float64

In [10]:
data

a  1   -0.527131
   2   -0.910607
   3    0.298445
b  1    0.113082
   3    0.449941
c  1    1.809865
   2   -0.155255
d  2   -0.432563
   3    0.378351
dtype: float64

In [12]:
data.unstack() #Important

          1         2         3
a -0.527131 -0.910607  0.298445
b  0.113082       NaN  0.449941
c  1.809865 -0.155255       NaN
d       NaN -0.432563  0.378351

In [13]:
data.unstack().stack()

a  1   -0.527131
   2   -0.910607
   3    0.298445
b  1    0.113082
   3    0.449941
c  1    1.809865
   2   -0.155255
d  2   -0.432563
   3    0.378351
dtype: float64

In [14]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=[['Ohio', 'Ohio', 'Colorado'],
['Green', 'Red', 'Green']])

In [15]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [16]:
frame.index.names = ["key1","key2"]
frame.columns.names = ["state","color"]

In [17]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [18]:
frame["Ohio"]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### Reordering and Sorting Levels

In [19]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [20]:
frame.sort_index(level = 1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [21]:
# Read this later